Revit 2027 API
STLExportOptions.ExportColor Property
 True to export color information, false otherwise. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportColor { get; set; }
Public Property ExportColor As Boolean
	Get
	Set
public:
property bool ExportColor {
	bool get ();
	void set (bool value);
}
member ExportColor : bool with get, set
Property Value
Boolean
Remarks
 Color information can be exported only in binary STL format, in the case of ASCII STL format this property will be ignored.
See Also
Reference
STLExportOptions Class
Autodesk.Revit.DB Namespace